# Essential CLI tools
brew "zsh"
brew "stow"
brew "nvim"
brew "curl"
brew "wget"
brew "jq"
brew "yq"
brew "tree"
brew "htop"
brew "fd"
brew "rsync"
brew "ssh-copy-id"
brew "watch"
brew "openssl"
brew "wrk"
brew "zola"
brew "kubectl"
brew "helm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "nvm"
brew "opentofu"
brew "awscli"
brew "telnet"
brew "ansible"
brew "go"
brew "uv"
brew "wireguard-tools"
brew "age"

# Zsh plugins
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# GUI applications
cask "warp"
cask "visual-studio-code"
cask "cursor"
cask "notion"
cask "typora"
cask "maccy"
cask "piclist"
cask "wechat"
cask "neteasemusic"
cask "telegram"
cask "postman"
cask "orbstack"
cask "wetype"
cask "betterdisplay"
cask "scroll-reverser"
cask "clash-verge-rev"
cask "microsoft-edge"
cask "1password"
cask "microsoft-office"
cask "lark"
cask "balenaetcher"
cask "chatgpt"
