cask_args appdir: '~/Applications', require_sha: true

# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "tencentcloud/tccli"

# Essential CLI tools
brew "git"
brew "zsh"
brew "stow"
brew "nvim"
brew "vim"
brew "curl"
brew "wget"
brew "jq"
brew "yq"
brew "tree"
brew "htop"
brew "fd"
brew "aliyun-cli"
brew "tccli"
brew "rsync"
brew "ssh-copy-id"
brew "watch"
brew "openssl"
brew "wrk"

# Development tools
brew "kubectl"
brew "helm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "nvm"
brew "terraform"
brew "awscli"
brew "telnet"
brew "ansible"
brew "go"

# Zsh plugins
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# GUI applications

# Terminal & Editors
cask "warp"
cask "visual-studio-code"
cask "cursor"

# Productivity
cask "notion"
cask "typora"
cask "maccy"

# Communication & Media
cask "wechat"
cask "neteasemusic"

# Development Tools
cask "postman"
cask "orbstack"

# Security & Privacy
cask "1password"

# System Utilities
cask "betterdisplay"
cask "scroll-reverser"

# Network Tools
cask "clash-verge-rev"
cask "microsoft-edge"