# Third-party taps
tap "tencentcloud/tccli"

# Essential macOS CLI tools
brew "argocd"
brew "awscli"
brew "curl"
brew "gh"
brew "helm"
brew "htop"
brew "jq"
brew "kubectl"
brew "kubectl-argo-rollouts"
brew "neovim"
brew "tccli"
brew "terraform"
brew "rsync"
brew "ssh-copy-id"
brew "stow"
brew "telnet"
brew "tree"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "wrk"
brew "zola"
brew "codex"

# GUI applications
cask "1password"
cask "antigravity"
cask "balenaetcher"
cask "betterdisplay"
cask "chatgpt"
cask "clash-verge-rev"
cask "cursor"
cask "google-chrome"
cask "lark"
cask "maccy"
cask "microsoft-edge"
cask "neteasemusic"
cask "notion"
cask "orbstack"
cask "piclist"
cask "postman"
cask "scroll-reverser"
cask "telegram"
cask "typora"
cask "visual-studio-code"
cask "warp"
cask "wechat"
cask "wetype"
cask "claude-code"
cask "microsoft-office"
